<a href="https://colab.research.google.com/github/theclassofai/Intro_2_Colab_Python/blob/master/Lesson_9_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

If we have two *Series*, each with the same index, we can combine them together. This will create a DataFrame.

In [1]:
import pandas as pd
ser1 = pd.Series({"Kanee":"Willamson", "Virat":"Kholi", "Sachin":"Tendulkar", "Ben":"Stokes"})
print(ser1)
df1 = pd.DataFrame(ser1)
print(df1)

Kanee     Willamson
Virat         Kholi
Sachin    Tendulkar
Ben          Stokes
dtype: object
                0
Kanee   Willamson
Virat       Kholi
Sachin  Tendulkar
Ben        Stokes

In [3]:
import pandas as pd
ser1 = pd.Series({"Kanee":"Willamson", "Virat":"Kholi", "Sachin":"Tendulkar", "Ben":"Stokes"}, name="PNames")
df_1 = pd.DataFrame(ser1)
print(df_1)

df_1.columns = ["S Name"]
print(df_1)

           PNames
Kanee   Willamson
Virat       Kholi
Sachin  Tendulkar
Ben        Stokes
           S Name
Kanee   Willamson
Virat       Kholi
Sachin  Tendulkar
Ben        Stokes

In [4]:
# Creating DataFrame from a List of Lists

mList = [["Virat","Kholi",1988,"Male"],
          ["Sachin", "Tendulkar", 1974, "Male"],
          ["Ben", "Stokes", 1989, "Male"]]
mdf = pd.DataFrame(mList)
display(mdf)

        0          1     2     3
0   Virat      Kholi  1988  Male
1  Sachin  Tendulkar  1974  Male
2     Ben     Stokes  1989  Male

In [5]:
mdf.set_index(0, inplace=True)
mdf

                1     2     3
0
Virat       Kholi  1988  Male
Sachin  Tendulkar  1974  Male
Ben        Stokes  1989  Male

In [8]:
# Creating DataFrame from Dict 

mDict = {"Virat": ["Kholi",1988,"Male"],
              "Ben":["Stokes", 1974, "Male"],
              "Sahcin": ["Tendulkar", 1989, "Male"]}

mdf2 = pd.DataFrame.from_dict(mDict)
print(mdf2) # Here the DataFrame will be created without key

   Virat     Ben     Sahcin
0  Kholi  Stokes  Tendulkar
1   1988    1974       1989
2   Male    Male       Male

In [7]:
# Creating DataFrame from Dict

mDict = {"Virat": ["Kholi",1988,"Male"],
              "Ben":["Stokes", 1974, "Male"],
              "Sahcin": ["Tendulkar", 1989, "Male"]}

mdf1 = pd.DataFrame.from_dict(mDict, orient="index")
print(mdf1) # Here the DataFrame will be created with key

                0     1     2
Virat       Kholi  1988  Male
Ben        Stokes  1974  Male
Sahcin  Tendulkar  1989  Male

In [9]:
# Creating DataFrame from Dict

mDict = {"Virat": ["Kholi",1988,"Male"],
              "Ben":["Stokes", 1974, "Male"],
              "Sahcin": ["Tendulkar", 1989, "Male"]}

mdf2 = pd.DataFrame.from_dict(mDict, orient="columns")
print(mdf2) # Here the DataFrame will be created with key

   Virat     Ben     Sahcin
0  Kholi  Stokes  Tendulkar
1   1988    1974       1989
2   Male    Male       Male

In [23]:
# Adding a New Series to an existing DataFrame
mDict = {"Virat": ["Kholi",1988,"Male"],
         "Ben":["Stokes", 1974, "Male"],
         "Sachin": ["Tendulkar", 1989, "Male"]}

mdf3 = pd.DataFrame.from_dict(mDict, orient="index",columns=["F Name", "DOB", "Sex"])
print(mdf3)

centuries = pd.Series({"Virat":45,"Ben":10, "Sachin":5}) # Adding series of existing dataframe
mdf3["centuries"] = centuries
print(mdf3)


halfcenturies = [60, 40, 50] # Adding List of existing dataframe
mdf3["halfcenturies"] = halfcenturies
print(mdf3)

           F Name   DOB   Sex
Virat       Kholi  1988  Male
Ben        Stokes  1974  Male
Sachin  Tendulkar  1989  Male
           F Name   DOB   Sex  centuries
Virat       Kholi  1988  Male         45
Ben        Stokes  1974  Male         10
Sachin  Tendulkar  1989  Male          5
           F Name   DOB   Sex  centuries  halfcenturies
Virat       Kholi  1988  Male         45             60
Ben        Stokes  1974  Male         10             40
Sachin  Tendulkar  1989  Male          5             50

### DataFrame: Querying and Slicing

In [24]:
# Difference between .loc[] and .iloc[]

mdf3.loc["Virat"] # in .loc[] we have to mention the name of row or key in the form of index

F Name           Kholi
DOB               1988
Sex               Male
centuries           45
halfcenturies       60
Name: Virat, dtype: object

In [27]:
mdf3.iloc[0] # in .iloc[] we have to mention the number in the form of index

F Name           Kholi
DOB               1988
Sex               Male
centuries           45
halfcenturies       60
Name: Virat, dtype: object

In [29]:
# Asking for multiple rows of coulms

mdf3.loc[["Virat", 'Ben']] # in .loc[] we have to mention the name of row or key in the form of list in double brackets

       F Name   DOB   Sex  centuries  halfcenturies
Virat   Kholi  1988  Male         45             60
Ben    Stokes  1974  Male         10             40

In [30]:
mdf3.iloc[[0,1]] # in .iloc[] we have to mention the name of row or key in the form of list in double brackets

       F Name   DOB   Sex  centuries  halfcenturies
Virat   Kholi  1988  Male         45             60
Ben    Stokes  1974  Male         10             40

In [32]:
mdf3.iloc[[0,1], [0, 1]] # Accessing multiple rows and columns together

       F Name   DOB
Virat   Kholi  1988
Ben    Stokes  1974

In [33]:
mdf3.loc[["Virat", 'Ben'], ['DOB','Sex']] # Accessing multiple rows and columns together

        DOB   Sex
Virat  1988  Male
Ben    1974  Male

In [35]:
mdf3["centuries"] > 20

Virat      True
Ben       False
Sachin    False
Name: centuries, dtype: bool

In [36]:
mdf3[mdf3["centuries"] > 20 ] # It will dataframe

      F Name   DOB   Sex  centuries  halfcenturies
Virat  Kholi  1988  Male         45             60